src/bsl/Documents/гкс_ВнешняяПроба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ВнешняяПроба</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураWarehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПродукцияWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДКомпозитнойПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сюрвейер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма MD5</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнспекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетныйВидПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КачественныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПробы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательВнешний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/Documents/гкс_ВнешняяПроба/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет запрос к сервису Warehouse для указанного типа операции и обрабатывает полученный ответ.
//
// Параметры:
//   ТипЗапроса - Строка- тип выполняемого запроса
//   ПараметрыЗапроса - Структура - параметры для формирования запроса
//
Процедура ВыполнитьЗапросКWarehouse(ТипЗапроса, ПараметрыЗапроса) Экспорт

	РесурсыСервисов = Справочники.гкс_РесурсыВебСервисов;
	РесурсВебСервиса = РесурсыСервисов.ОписаниеПоИмениПредопределенного(ТипЗапроса);

	Если Не ЗначениеЗаполнено(РесурсВебСервиса) Тогда
		Возврат;
	КонецЕсли;

	Если РесурсВебСервиса = РесурсыСервисов.ExternalSamples_GetById Тогда
		ПараметрыЗапроса.Вставить("id", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗапроса.Ссылка, "ИДПробы"));
	КонецЕсли;

	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", "date,createdOn,updatedOn,loadDate");

	ДанныеОтветаВСтруктуре = гкс_ИнтеграцияWarehouse.ВыполнитьЗапросКWarehouse(
		РесурсВебСервиса, ПараметрыЗапроса, ПараметрыПреобразованияJSON);

	гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ДанныеОтветаВСтруктуре, ПараметрыЗапроса.Ссылка);

КонецПроцедуры

// Обновляет или создает документ "Внешняя проба" на основании данных из системы Warehouse.
// Записывает документ при изменении контрольной суммы.
//
// Параметры:
//   ДанныеИсточника - Массив из Структура - Массив структур с данными пробы из Warehouse.
//   Первая структура содержит основные данные, остальные — показатели качества.
//
Процедура ОбновитьПоДаннымWarehouse(ДанныеИсточника) Экспорт

	МенеджерСоотвествияОбъектов = РегистрыСведений.гкс_СоответствиеОбъектовWarehouse;

	ПерваяСтрокаДанных = ДанныеИсточника[0];
	ДокументВнешнейПробы = ПолучитьСсылкуПоИдентификатору(ПерваяСтрокаДанных.ИДПробы);

	Если Не ЗначениеЗаполнено(ДокументВнешнейПробы) Тогда
		ВнешняяПроба = Документы.гкс_ВнешняяПроба.СоздатьДокумент();
	Иначе
		ВнешняяПроба = ДокументВнешнейПробы.ПолучитьОбъект();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ВнешняяПроба, ПерваяСтрокаДанных);
	ВнешняяПроба.Дата = ПерваяСтрокаДанных.ДатаПробы;
	ВнешняяПроба.НоменклатураWarehouse = ПерваяСтрокаДанных.Продукция;
	ВнешняяПроба.Номенклатура = МенеджерСоотвествияОбъектов.
								СсылкаОбъектаПоСсылкеWarehouse(ПерваяСтрокаДанных.Продукция);

	ВнешняяПроба.КачественныеПоказатели.Очистить();

	Для Каждого ДанныеСтроки Из ДанныеИсточника Цикл
		НоваяСтрока = ВнешняяПроба.КачественныеПоказатели.Добавить();
		НоваяСтрока.ВидПробы = ДанныеСтроки.ВидПробы;
		НоваяСтрока.ПоказательВнешний = ДанныеСтроки.Показатель;
		НоваяСтрока.Показатель = МенеджерСоотвествияОбъектов.
								СсылкаОбъектаПоСсылкеWarehouse(ДанныеСтроки.Показатель);

		НоваяСтрока.Значение = ДанныеСтроки.ЗначениеПоказателя;
	КонецЦикла;

	КонтрольнаяСуммаДокументаНовая = ВнешняяПроба.КонтрольнаяСуммаДокумента();

	// записываем только если есть изменения клювых данных
	Если ВнешняяПроба.КонтрольнаяСумма = КонтрольнаяСуммаДокументаНовая Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ВнешняяПроба.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Интеграция Warehouse.Формирование документов ""Внешняя проба""'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки);
	КонецПопытки;

КонецПроцедуры

// Возвращает ссылку на документ по идентификатору
//
// Параметры:
//  Идентификатор - Строка - идентификатор Warehouse.
//
// Возвращаемое значение:
//  ДокументСсылка.гкс_ВнешняяПроба - ссылка на документ.
//
Функция ПолучитьСсылкуПоИдентификатору(Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешняяПроба.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_ВнешняяПроба КАК ВнешняяПроба
	|ГДЕ
	|	ВнешняяПроба.ИДПробы = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе
		Результат = ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Вычисляет контрольную сумму по алгоритму MD5.
//
// Параметры:
//  КонтролируемыеДанные - Структура
//
// Возвращаемое значение:
//  Строка - контрольная сумма строкой без пробелов (например 32 символа).
//
Функция КонтрольнаяСумма(КонтролируемыеДанные) Экспорт

	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(КонтролируемыеДанные);

КонецФункции

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт

	Возврат "ИДПробы";

КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт

	Возврат "id";

КонецФункции

// Возвращает правила конвертации свойств документа для интеграции с системой Warehouse
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт

	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИДПробы", 			"id");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИДКомпозитнойПробы", "groupId");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Дата", 				"date");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаПогрузки", 		"loadDate");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаИзменения", 		"updatedOn");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Организация", 		"client", 1, "ПКС_Организация");
	//гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Номенклатура", 		"");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НоменклатураWarehouse",
																"goodId", 1, "ПКС_НоменклатураWarehouse");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерТС", 			"transport");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ТранспортноеСредство",
																"transport", 1, "ПКС_ТранспортноеСредство");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СтанцияОтправления",
																"stationId", 1, "ПКС_СтанцияОтправления");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СтанцияНазначения",
																"stationDestId", 1, "ПКС_СтанцияНазначения");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерЗаявки", 		"orderNumber");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерДокумента", 	"refId");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Комментарий", 		"commentary");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Сюрвейер", 			"contractor", 1, "ПКС_Сюрвейер");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "МестоИнспекции", 	"inspectionPlace");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПриоритетныйВидПробы", "priorityExSampleTypeName");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесБрутто", 	"weightGross");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесТары", 	"weightTare");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесНетто", 	"weightNet");

	// правила для табличной части "КачественныеПоказатели"
	ПравилаКонвертацииТЧКачественныеПоказатели = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели,
		"ВидПробы", "externalSampleType", 1, "ПКС_ВидПробы");


	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели,
		"ПоказательВнешний", "qualityIndicatorId", 1, "ПКС_ПоказательКачестваWarehouse");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, "Значение", "value");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, "Комментарий", "commentary");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации,
	 	"КачественныеПоказатели", "externalSampleTestResults", , ПравилаКонвертацииТЧКачественныеПоказатели, Истина);

	Возврат ПравилаКонвертации;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
